/*
 * [Rocky 2017-12-26 11:37:52]
 * 全局错误定义
 */
export const errcode = {
  OK: 0, // 正确
  SYS_ERR: -10001, // 系统出错
  PARAM_ERR: -10002, // 参数出错
  SYS_BUSY: -10003, // 系统忙
  USER_NO_EXIST: -10005, // 用户不存在
  USER_HAD_REG: -10006, // 此用户名已被注册
  USER_PASSWD_ERR: -10007, // 登录密码出错
  DATA_PASSWD_ERR: -10008, // 密码错误
  DATA_CHANGE: -10009, // 数据已有变动（刷新后再修改）
  DATA_OWNER_ERR: -10010, // 不是当前用户的数据
  DATA_KEY_USED: -10011, // key已被使用
  USER_NAME_EMPTY: -10012, // 用户名不能为空
  FILE_NOT_EXIST: -10013, // 文件不存在
  CREATE_ZIPFILE_ERR: -10014, // 创建zip压缩文件出错
  FILE_UPLOAD_ERR: -10015, // 文件上传出错
  OPEN_ZIPFILE_ERR: -10016, // 打开压缩文件出错
  NO_BAK_FILE: -10017, // 文件格式出错（不是备份文件）
  BAKFILE_DATA_ERR: -10018, // 备份文件中数据出错 
  BAKFILE_PASSWD_ERR: -10019, // 备份文件密码出错
  USER_NOLOGIN: -10020, // 用户未登录
  USER_LOGINED: -10021, // 用户已经登录过
  DATA_KEY_NOT_EXIST: -10022, // 通讯用key不存在
  DB_OPR_ERR: -10023, // 数据库操作出错
  PHONE_IS_EXIST: -10026, // 手机号已被使用
  USER_SETTING_ERR: -10028, // 设置登录用户出错
  EMAIL_IS_EXIST: -10029, // 邮箱已被使用
  NOT_BIND_PHONE: -10030, // 不是绑定的手机号码
  CFG_NO_EXIST: -20001, // 配置文件不存在
  CFG_WRITE_ERR: -20002, // 配置文件写入出错
  GOODS_SERIAL_USED: -20003, // 货品编号已被使用
  CLASS_NAME_USED: -20004, // 类别名已存在
  GOODS_NOT_EXIST: -20005, // 货品不存在
  USER_OLD_PASSWD_ERR: -20006, // 原密码错误
  FILE_IS_DIR: -20007, // 是个目录
  FILE_BAK_ERR: -20008, // 备份文件出错
  FILE_PATH_ERR: -20009, // 路径出错
  FILE_WRITE_ERR: -20010, // 文件写入出错
  USER_PERMISSION_ERR: -20011, // 操作权限不足
  FILE_NO_EXIST: -20012, // 文件不存在
  LOG_OPR_ERR: -20013, // 日志操作出错
  LOG_NO_EXIST: -20014, // 日志不存在
  DB_ERR: -20030, // 数据库操作出错
  UPDATE_PACK_ERR: -20031, // 升级包出错
  BATCH_FILE_NOT_UNIQ: -20032, // 同批次文件中存在相同文件
  NOT_GROUP_FILE: -20033, // 没有组文件
  NAME_IS_EXIST: -20034, // 名称已存在
  HOTEL_NOT_EXIST: -20035, // 酒店不存在
  PHONE_ERR: -20037, // 手机号码不正确
  EMAIL_ERR: -20038, // 邮箱不正确
  MAIL_CODE_ERR: -20039, // 邮箱密文不正确
  COKE_ERR: -20040, // 验证码不正确
  SHOP_LABEL_ERR: -20041, // 标签名为空
  PHONE_COKE_ERR: -20042, // 手机验证不正确
  PHONE_SEND_FAIL: -20043, // 手机发送失败
  NEWS_NUM_MAX: -20044, // 发送消息数超出限制
  PASSWORD_TWO_SAME: -20045, // 2次输入的密码不一样
  EMAIL_SEND_FAIL: -20046, // 邮箱发送失败
  DEPARTMENT_IS_EXIST: -20047, // 部门名称重复
  IDCARD_ERR: -20048, // 身份证号码不正确
  PHONE_VERIFY_ERR: -20049, //手机验证过程出错
  USER_NOT_ZC: -20050, //用户没有注册
  ORDER_SEAT_NO: -20051, //订单中含有该餐桌
  EMPLOYEE_IS_EXIT: -20060, //该员工已经邀请过了
  PHONE_TWO_NOT: -20061, //俩次输入的电话号码不一样
  WEIXIN_NO_LOGIN: -20062, //此微信未绑定,不能登录
  WEIXIN_NO_BINDING: -20063, //此微信已绑定账号,不能重复绑定
  WEIXIN_NO_REBINDING: -20064, //账号与微信不符,不能解除绑定
  INVOICING_NOT: -20065, //用户没开票
  FOOD_ERR: -20066, //餐品出错
  INVOICE_IS_ERR: -20067, //发票错误
  FEE_MONEY_ERR: -20068, //减免金额出错
  CODE_NOT_SET: -20069, //二维码未设置
  NEWS_NOT_CONTENT: -20070, // 系统消息无内容
  NEWS_ID_NOT_EP: -20071, // 消息id不能为空
  FOOD_NO_SPC: -20072, // 该餐品无份量规格
  ADDRESS_REPEAT: -20073, // 地址已存在
  RESERVATION_TIME_GO: -20074, //预约时间不在当前时间之后
  AGENT_NO_EXIST: -20075, //区域商代理不存在
  NEWS_IS_SEND: -20076, // 系统消息已发送
  PASSWORD_SAME: -20077, //原密码和新密码一样
  EMPLOYEE_NOT_LOGIN: -20078, // 该员工无登录权限
  AGENT_IS_EXIST: -20079, //代理商区域重复
  AGENT_NO_CHANGE: -20080, // 此代理商下有店铺，不能修改
  ADMIN_IS_EXIST: -20081,        // 管理员重复(一个账号只能创建一个店铺)
  NOT_AUTHORIZATION: -20082,       // 未获得授权,请联系店铺管理人员设置
  ADMIN_PASWORD_ERR: -20083,        // 管理员账号或密码不正确<<<<<<<<<<<<<<<<<
  GET_LIST_ERR: -20084,        // 加载失败,请重新操作
  APPLY_IS_EXIST: -20085,        // 申请不能重复
  PLAY_NOT_ZERO: -20086,        // 支付金额不能小于0.01
  SELFHELP_IS_BINDING: -20087,        // 自助点餐机已绑定
  USER_SELFHELP_BINDING: -20088,        // 该账户已经绑定过点餐机了

  FOOD_IMG_TOOMANY: -30010, // 图片过多
  FOOD_EXIST: -30011, // 餐品名称已存在
  ORDER_STATUS_ERR: -30012, // 订单状态出错
  BROWSER_NOT_WEIXIN: -30013, // 请在微信中打开
  SHOP_NOT_WEIXIN: -30014, // 店铺不存在
  ORDER_NOT_MODIFY: -30015, // 订单处于不可更改阶段，可重新下单
  ORDER_ST_CONFIRMED: -30016, // 订单已确认，不能修改
  ORDER_ST_PAID: -30017, // 订单已支付，不能修改
  ORDER_ST_FINISH: -30018, // 订单已完成，不能修改
  ORDER_ST_CANCEL: -30019, // 订单已作废，不能修改
  ORDER_ST_TIMEOUT: -30020, // 订单超时，不能修改
  ORDER_ST_PRINTED: -30021, // 订单已出单，不能修改
  ORDER_ST_ERR: -30022, // 订单出错，不能修改
  SEAT_NOT_EXIST: -30023, // 餐桌号不存在
  SHOP_NOT_EXIST: -30024, // 店铺不存在
  FOOD_NOT_ENOUGH: -30025, // 餐品存量不够
  ORDER_OPR_ERR: -30026, // 订单操作出错
  FOOD_NOT_EXIST: -30027, // 餐品不存在
  ORDER_NOT_EXIST: -30028, // 订单不存在
  ORDER_HAD_CHANGE: -30029, // 订单已有变动，请刷新后再操作
  PHONE_CODE_LAPSE: -30030, // 手机验证码超时
  MAIL_TIME_LAPSE: -30031, // 手机验证码超时
  CATE_NOT_DEL: -30032, // 此分类下有商品，不能删除
  DEPARTMENT_NOT_DEL: -30033, // 此部门下有员工，不能删除
  EMPLOYEE_IS_FREEZE: -30034, // 此部门员工已被冻结
  SEAT_IS_EXIST: -30035, // 餐桌号已存在
  SHOP_SUSPEND: -30036, // 系统暂停使用
  RESERVATION_NOT_EXIST: -30037, // 预约不存在
  FOOD_SALE_OFF: -30038, //餐品已下架
  POSITION_NOT_DEL: -30039, // 此职位下有员工，不能删除
  NO_CATE: -30040, // 没有此分类名
  IMG_NOT_MORE: -30043, // 图片更换不到一个月
  SHOP_IS_FREEZE: -30044, // 此店铺已被冻结
  AGENT_IS_FREEZE: -30045, // 此代理商已被冻结

  //{{ 微信端移来
  PAY_ERR: -30041, // 支付取消或失败
  PAY_NEED_PASSWD: -30042, // 支付需要密码
  //}}

  //{{ costomer端移来(代码重设置)
  ORDER_IS_URGE: -30052, // 订单已催单
  ORDER_URGE_TIME: -30053, // 催单时间还未到
  ORDER_NOT_PRINTED: -30054, // 订单还未下单
  SHOP_ID_NOT: -20036, // 没有餐馆ID
  WX_NO_SUPPORT: -30055, // 未开通微信支付
  NO_EAT_AFTER: -30056,       // 不支持餐后支付
  ALIPAYPLAY_NO_SUPPORT: -30057,       // 未开通支付宝支付
  //}}

  //{{ 后台服务出错码
  SVC_ERR_SYS: -100001, // 内部错误
  SVC_ERR_PARAM: -100002, // 参数错误
  SVC_ERR_USER_REGISTER: -100003, // 注册用户出错
  SVC_ERR_USER_NOT_EXIST: -100004, // 用户不存在
  SVC_ERR_DB: -100005, // 数据库出错
  SVC_ERR_RSA_ENC: -100006, // rsa加密出错
  SVC_ERR_RSA_DEC: -100007, // rsa解密出错
  SVC_ERR_USER_NOT_LOGIN: -100008, // 用户未登录
  SVC_ERR_LOGIN_ERR: -100009, // 用户登录出错
  SVC_ERR_WS_CMD_UNKNOWN: -100010, // 未知的websocket处理命令
  SVC_ERR_DATA_SEND: -100011, // 数据发送出错
  SVC_ERR_CHANNEL_NOT_EXIST: -100012, // 订阅频道不存在
  SVC_ERR_CONNECT_CLOSED: -100013, // 连接已断开
  SVC_ERR_DATA_SIGN: -100020, // 签名出错
  //}}

  // xxx         = -200010;      // 出错描述
  SMS_SEND_ERR: -200020,     // 短信发送出错
  SHOP_IS_AUDIT: -200030,     // 未到审核级或已被同级审核
  NO_EMPLOYEE: -200040,    // 员工不存在
  FOOD_MADE_FINISH: -200050,     // 该订单已完成制作
  GOOD_HOT_TOPLIMIT: -200060,      // 热卖商品超过上限
  SEAT_HAVE_RES: -200070,      // 餐桌已被预订
  PROVINCE_ERR: -200080,      // 代区域不合法
  FROM_ERR: -200090,     // 来源已经被运用
  VERSION_ERR: -200100,     // 没有版本号存在,请联系管理员
  SET_ERR: -200110,     // 代理商设置重复
  PAY_PASSWD_ERR: -200120,     // 支付密码错误
  MONEY_NOT_ENOUGH: -200130,      // 余额不足
  GOODS_NOT_ENOUGH: -200140,     // 商品库存不足
  PASSWORD_ERR_TOOMANY: -200150,     // 密码出错次数过多
  RESOURCES_NOT_ENOUGH: -200160,     // 登录授权数不足
  NOT_BIND_TERM: -200170,     // 不是绑定终端
  LOGIN_LAPSE: -200180,     // 登录超时
  EXPRESS_COMPANY_ERR: -200190,     // 快递公司错误
  ADDRESS_NOT: -200200,     // 地址未设置
  GOODS_SALE_OFF: -200210,       // 商品品已下架
  EVA_IS_EXIST: -200220, //请勿重复评价
  GOODS_SPEC_CHANGE: -200230, //商品信息已改变
  SHOP_PERMISSION_START: -200240,     // 店铺职位被冻结(权限)
  NOT_INVOICE: -200250,     // 此订单不能开票或已开票
  ROLE_IS_USE: -200260,     // 角色已被使,不可删除
  SYS_DEFAULT: -200270,     // 系统默认无法编辑
  POSITION_IS_USE: -200280,     // 提示
  NOT_BIND_USER: -200290,     // 账号已被使用（不是绑定终端）
  AISLE_IS_FULL: -200300,     // 货道已满
  USER_LOGINED_EXIST: -200310,     // 该账号正在使用，无法重复登录
  USER_LOGIN_ERR: -200320,     // 用户账号或密码错误
  REMINDER: -200330,//已催单
  VENDOR_NUM_EXIST: -200340, //设备号重复
  VAISLE_NOT_CHANGE: -200350, //货道数不能更改
  USER_NO_BINDING: -200360, //该账号已绑定其它微信,不能重复绑定
  PASSWORD_REPEAT: -200370,     // 支付密码不能与登录密码相同
  NOT_CUIHUI: -200380,     // 不属于萃荟信息，不能操作
  NOT_RECHARGE: -200390,     // 此账号不能充值
  ALI_NO_LOGIN: -200400,     // 未绑定支付宝账号,请使用账号密码登录

  code: {
    "0": "正确",
    "-10001": "系统出错",
    "-10002": "参数出错",
    "-10003": "系统忙",
    "-10005": "用户不存在",
    "-10006": "登录手机号已被注册",
    // "-10006": "此用户名已被注册",
    "-10007": "账号或登录密码出错",
    // "-10007": "登录密码出错",
    "-10008": "密码错误",
    "-10009": "数据已有变动（刷新后再修改）",
    "-10010": "不是当前用户的数据",
    "-10011": "key已被使用",
    "-10012": "用户名不能为空",
    "-10013": "文件不存在",
    "-10014": "创建zip压缩文件出错",
    "-10015": "文件上传出错",
    "-10016": "打开压缩文件出错",
    "-10017": "文件格式出错（不是备份文件）",
    "-10018": "备份文件中数据出错",
    "-10019": "备份文件密码出错",
    "-10020": "用户未登录",
    "-10021": "用户已经登录过",
    "-10022": "通讯用key不存在",
    "-10023": "数据库操作出错",
    "-10026": "手机号已被使用",
    "-10028": "设置登录用户出错",
    "-10029": "邮箱已被使用",
    "-10030": "不是绑定的手机号码",
    "-20001": "配置文件不存在",
    "-20002": "配置文件写入出错",
    "-20003": "货品编号已被使用",
    "-20004": "类别名已存在",
    "-20005": "货品不存在",
    "-20006": "原密码错误",
    "-20007": "是个目录",
    "-20008": "备份文件出错",
    "-20009": "路径出错",
    "-20010": "文件写入出错",
    "-20011": "操作权限不足",
    "-20012": "文件不存在",
    "-20013": "日志操作出错",
    "-20014": "日志不存在",
    "-20030": "数据库操作出错",
    "-20031": "升级包出错",
    "-20032": "同批次文件中存在相同文件",
    "-20033": "没有组文件",
    "-20034": "名称已存在",
    "-20035": "酒店不存在",
    "-20037": "电话号码不正确",
    "-20038": "邮箱不正确",
    "-20039": "邮箱密文不正确",
    "-20040": "验证码不正确",
    "-20041": "标签名为空",
    "-20042": "手机验证码不正确",
    "-20043": "手机发送失败",
    "-20044": "发送消息数超出限制",
    "-20045": "2次输入的密码不一样",
    "-20046": "邮箱发送失败",
    "-20047": "部门名称重复",
    "-20048": "身份证号码不正确",
    "-20049": "手机验证过程出错",
    "-20050": "用户没有注册",
    "-20051": "订单中含有该餐桌",
    "-20060": "该员工已经邀请过了",
    "-20061": "俩次输入的电话号码不一样",
    "-20062": "此微信未绑定,不能登录",
    "-20063": "此微信已绑定账号,不能重复绑定",
    "-20064": "账号与微信不符,不能解除绑定",
    "-20065": "用户没开票",
    "-20066": "餐品出错",
    "-20067": "发票错误",
    "-20068": "减免金额出错",
    "-20069": "二维码未设置",
    "-20070": "系统消息无内容",
    "-20071": "消息id不能为空",
    "-20072": "该餐品无份量规格",
    "-20073": "地址已存在",
    "-20074": "预约时间不在当前时间之后",
    "-20075": "区域商代理不存在",
    "-20076": "系统消息已发送",
    "-20077": "原密码和新密码一样",
    "-20078": "该员工无登录权限",
    "-20079": "代理商区域重复",
    "-20080": "此代理商下有店铺，不能修改",
    "-20081": "未获得授权,请联系店铺管理人员设置",
    "-20082": "未获得授权,请联系店铺管理人员设置",
    "-20083": "管理员账号或密码不正确",
    "-20084": "加载失败,请重新操作",
    "-20085": "申请不能重复",
    "-20086": "支付金额不能小于0.01",
    "-20087": "自助点餐机已绑定",
    "-20088": "该账户已经绑定过点餐机了",

    "-30010": "图片过多",
    "-30011": "餐品名称已存在",
    "-30012": "订单状态出错",
    "-30013": "请在微信中打开",
    "-30014": "店铺不存在",
    "-30015": "订单处于不可更改阶段，可重新下单",
    "-30016": "订单已确认，不能修改",
    "-30017": "订单已支付，不能修改",
    "-30018": "订单已完成，不能修改",
    "-30019": "订单已作废，不能修改",
    // "-30020": "订单超时，不能修改",
    "-30020": "订单超过7天，不能评价",
    "-30021": "订单已出单，不能修改",
    "-30022": "订单出错，请重新下单",
    "-30023": "餐桌号不存在",
    "-30024": "店铺不存在",
    "-30025": "餐品存量不够",
    "-30026": "订单操作出错",
    "-30027": "餐品不存在",
    "-30028": "订单不存在",
    "-30029": "订单已有变动，请刷新后再操作",
    "-30030": "手机验证码超时",
    "-30031": "手机验证码超时",
    "-30032": "此分类下有商品，不能删除",
    "-30033": "此部门下有员工，不能删除",
    "-30034": "此部门员工已被冻结",
    "-30035": "餐桌号已存在",
    "-30036": "系统暂停使用",
    "-30037": "预约不存在",
    "-30038": "餐品已下架",
    "-30039": "此职位下有员工，不能删除",
    "-30040": "没有此分类名",
    // "-30043": "图片更换不到一个月",
    "-30043": "一个月内只能更换一次店铺Logo",
    "-30044": "此店铺已被冻结",
    "-30045": "此代理商已被冻结",

    "-30041": "支付取消或失败",
    "-30042": "支付需要密码",

    "-30052": "订单已催单",
    "-30053": "催单时间还未到",
    "-30054": "订单还未下单",
    "-20036": "没有餐馆ID",
    "-30055": "未开通微信支付",
    "-30056": "不支持餐后支付",
    "-30057": "未开通支付宝支付",

    "-100001": "内部错误",
    "-100002": "参数错误",
    "-100003": "注册用户出错",
    "-100004": "用户不存在",
    "-100005": "数据库出错",
    "-100006": "rsa加密出错",
    "-100007": "rsa解密出错",
    "-100008": "用户未登录",
    "-100009": "用户登录出错",
    "-100010": "未知的websocket处理命令",
    "-100011": "数据发送出错",
    "-100012": "订阅频道不存在",
    "-100013": "连接已断开",
    "-100020": "签名出错",


    "-200020": "短信发送出错",
    "-200030": "未到审核级或已被同级审核",
    "-200040": "员工不存在",
    "-200050": "该订单已完成制作",
    "-200060": "热卖商品超过上限",
    "-200070": "餐桌已被预订",
    "-200080": "代区域不合法",
    "-200090": "来源已经被运用",
    "-200100": "没有版本号存在,请联系管理员",
    "-200110": "代理商设置重复",
    "-200120": "支付密码错误",
    "-200130": "余额不足",
    "-200140": "商品库存不足",
    "-200150": "密码出错次数过多",
    "-200160": "登录授权数不足",
    "-200170": "不是绑定终端",
    "-200180": "登录超时",
    "-200190": "快递公司错误",
    "-200200": "地址未设置",
    "-200210": "商品已下架",
    "-200220": "请勿重复评价",
    "-200230": "商品信息已改变",
    "-200240": "此订单不能开票或已开票",
    "-200260": "角色已被使,不可删除",
    "-200270": "系统默认无法编辑",
    "-200280": "提示",
    "-200290": "账号已被使用（不是绑定终端）",
    "-200300": "货道已满",
    "-200310": "该账号正在使用，无法重复登录",
    "-200320": "用户账号或密码错误",
    "-200330": "已催单",
    "-200340": "设备号重复",
    "-200350": "货道数不能更改",
    "-200360": "该账号已绑定其它微信,不能重复绑定",
    "-200370": "支付密码不能与登录密码相同",
    "-200380": " 不属于萃荟信息，不能操作",
    "-200390": " 此账号不能充值",
    "-200400": "未绑定支付宝账号,请使用账号密码登录",
  },
  toString: function (code) {
    code = parseInt(code || 0);
    return this.code[code] || "未知[" + code + "]";
  }
  ///////////////////////////////////////////////////////////////////
  //
  //     无特殊要求，上定义不要改变，新加的出错码写下在，按10递增
  //
  ///////////////////////////////////////////////////////////////////

  //const xxx         = -200010       // 出错描述

  /*
         * 注意同步修改 js/cfg.js --> errcode
         */
};

/**
 * 设备状态   
 */
export const VendorStatus = {
  NORMAL: 1,
  DAMAGE: 2,
  LACK: 3,
  SHORT: 4,
  OFFLINE: 5,
  code: {
    1: "正常",
    2: "故障",
    3: "缺货",
    4: "断货",
    5: "离线",
  },
  toString: function (code) {
    code = parseInt(code || 0);
    return this.code[code] || "未知[" + code + "]";
  }
};

/**
 * 货道每一个容量的状态
 */
export const AisleCapStatus = {
  EMPTY: 1,
  HASGOODS: 2,
  ADDSELECT: 3,
  STOCKSHORT: 4,
  code: {
    1: "未补货",
    2: "无需补货",
    3: "补货选中",
    4: "库存不足"
  },
  toString: function (code) {
    code = parseInt(code || 0);
    return this.code[code] || "未知[" + code + "]";
  }
};

//是否绑定微信
export const isWxBind = {
  YES: 1,
  NO: 0,
  code: {
    1: "是",
    0: "否"
  },
  toString: function (code) {
    code = parseInt(code || 0);
    return this.code[code] || "未知[" + code + "]";
  }
};

/**
 * 订单状态
 */
export const OrderStatus = {
  NOTPAY: 1,
  PAYSUCC: 2,
  REFUND: 3,
  REFUNDEDPART: 4,
  REFFAIL: 5,
  code: {
    1: "未支付",
    2: "已支付",
    3: "退款成功",
    4: "退款部分成功",
    5: "退款失败"
  },
  toString: function (code) {
    code = parseInt(code || 0);
    return this.code[code] || "未知[" + code + "]";
  }
};

/**
 * 支付方式
 */
export const PayWay = {
  WECHAT: 1,
  ALIPAY: 2,
  code: {
    1: "微信支付",
    2: "支付宝支付"
  },
  toString: function (code) {
    code = parseInt(code || 0);
    return this.code[code] || "未知[" + code + "]";
  }
};

/**
 * 故障处理进度
 */
export const DealSteps = {
  NOTDEAL: 1,
  DEALING: 2,
  FINISHDEAL: 3,
  code: {
    1: "未处理",
    2: "处理中",
    3: "处理成功",
  },
  toString: function (code) {
    code = parseInt(code || 0);
    return this.code[code] || "未知[" + code + "]";
  }
};

/**
 * 设备开关锁 0关锁 ，1开锁
 */
export const VendorLockStatus = {
  NO: 0,
  YES: 1,
  code: {
    0: "开锁",
    1: "已开锁",
  },
  toString: function (code) {
    code = parseInt(code || 0);
    return this.code[code] || "未知[" + code + "]";
  }
};
//vender 的一些配置
export const VENDOR = {
  shop_id: "SH888",
  vendor_ownership: "赛领科技信息有限公司"
};